Revit 2024 API
AllowedValues Enumeration
 A range of allowed values.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Since: 2014
Syntax
C#
public enum AllowedValues
Visual Basic
Public Enumeration AllowedValues
Visual C++
public enum class AllowedValues
Members
Member name | Description
NonNegative |  Only non-negative values are allowed. A tolerance of 1.0e-9 is used, so very small negative numbers are accepted.
All |  All values are allowed.
Positive |  Only positive values are allowed. A tolerance of 1.0e-9 is used, so very small positive numbers are rejected.
See Also
Autodesk.Revit.DB Namespace